---
kind: property
id: P:Autodesk.Revit.DB.Curve.IsBound
zh: 曲线
source: html/cdf2a8e3-31fe-996a-1e94-e5eb77378279.htm
---
# Autodesk.Revit.DB.Curve.IsBound Property

**中文**: 曲线

Describes whether the parameter of the curve is restricted to a particular interval.

## Syntax (C#)
```csharp
public bool IsBound { get; }
```